trunk/openmodeller/src/soap/openModeller.ping.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:om="http://openmodeller.sf.net/ns/1.0">
 <SOAP-ENV:Body id="_0">
  <om:ping>
  </om:ping>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
